src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьТоваров</registerRecords>
  <registerRecords>AccountingRegister.РегистрБухгалтерии</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УпрСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/СтоимостьТоваров/СтоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccountingRegisters/РегистрБухгалтерии/РегистрБухгалтерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБухгалтерии</name>
  <chartOfAccounts>ChartOfAccounts.ПланСчетов</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.ЮрЛица</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.ПланСчетов.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.ПланСчетов.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.ПланСчетов.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>ВалСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.ПланСчетов.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>УпрСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.ПланСчетов.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/ChartsOfAccounts/ПланСчетов/ПланСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>ПланСчетов</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>01</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>01.1</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>01.2</code>
      </childItems>
      <childItems>
        <name>ТоварыОпт</name>
        <description>Товары</description>
        <code>01.5</code>
      </childItems>
      <childItems>
        <name>КассаВВалюте</name>
        <description>Касса в валюте</description>
        <code>01.11</code>
      </childItems>
    </items>
    <items>
      <name>Пассивы</name>
      <description>Пассивы</description>
      <code>02</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Прибыль</name>
        <description>Прибыль</description>
        <code>02.1</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>Взаиморасчеты</name>
      <description>Взаиморасчеты</description>
      <code>03</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>03.1</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>03.2</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

src/Documents/ПриходнаяНакладная/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Если ВидПоступления = 0 Тогда
		СчетУчетаТоваров = ПланыСчетов.ПланСчетов.Товары;
	Иначе
		СчетУчетаТоваров = ПланыСчетов.ПланСчетов.ТоварыОпт;
	КонецЕсли; 
	
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.СтоимостьТоваров.Записывать = Истина;
	Движения.РегистрБухгалтерии.Записывать = Истина;
	
	ТЗ = Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура","Количество, Сумма, УпрСумма");
	
	Для Каждого ТекСтрокаТовары Из ТЗ Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
		Движение = Движения.СтоимостьТоваров.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Партия = Ссылка;
		Движение.Количество = 	ТекСтрокаТовары.Количество;
		Движение.Стоимость =  	ТекСтрокаТовары.Сумма;
		
		Проводка = Движения.РегистрБухгалтерии.Добавить();
		Проводка.Период = Дата;
		Проводка.СчетДт = СчетУчетаТоваров;
		Проводка.СчетКт = ПланыСчетов.ПланСчетов.Поставщики;
		Проводка.СубконтоДт.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Проводка.СубконтоДт.Склады = Склад;
		Проводка.Сумма = ТекСтрокаТовары.Сумма;
		Проводка.УпрСумма = ТекСтрокаТовары.УпрСумма;
		Проводка.КоличествоДт = ТекСтрокаТовары.Количество;
		Проводка.СодержаниеПроводки = "Поступили товары";
		
		//Проводка.КоличествоКт = ТекСтрокаТовары.Количество; //Ошибка
		
		Проводка.СубконтоКт.Контрагенты = Контрагент;
		
	КонецЦикла;
КонецПроцедуры
